let cards = [
    { 
        name: "The Fool",
        image: "images/Fool.jpg",
        meaning: "วันนี้คุณจะได้เริ่มต้นวันใหม่ด้วยความสดใส เปิดโอกาสให้ตนเองได้ทำในสิ่งที่คาดหวังเอาไว้ ลงมือทำตามสิ่งที่ใจต้องการ อย่ากลัวการเริ่มต้นหากคุณไม่อยากยืนอยู่ที่เดิม"
    },
    
    { 
        name: "The Magician",
        image: "images/Magician.jpg",
        meaning: "รู้สึกหรือเปล่าว่าวันนี้คุณมีไฟในการทำสิ่งต่าง ๆ มากเป็นพิเศษ สิ่งที่คุณรู้สึกนั้นถูกต้องแล้ว เพราะวันนี้เราจะได้แสดงความเป็นตัวเองออกมาให้คนรอบข้างเห็นถึงศักยภาพ สร้างสรรค์วันที่ดีด้วยตัวของคุณเอง"
    },
    
    { 
        name: "The High Priestess",
        image: "images/High_Priestess.jpg",
        meaning: "สัญชาตญาณของคุณจะแม่นมากในช่วงนี้ สิ่งที่คุณรู้สึกจะมีโอกาสเป็นไปตามที่คิดเอาไว้ รวมไปถึงในวันนี้คุณจะได้รับคำตอบในสิ่งที่รอคอยมานาน ได้ปลดล็อกตัวเองจากเรื่องที่ค้างคาอยู่ภายในใจ ปล่อยให้หัวใจนำทางแล้วคุณจะพบกับสิ่งดี ๆ ที่รอคอยคุณอยู่ในวันนี้"
    },
    
    { 
        name: "The Empress",
        image: "images/Empress.jpg",
        meaning: "คุณจะได้รับโอกาสใหม่ ๆ และมีคนคอยช่วยเหลืออยู่ตลอด ทำให้ผ่านเรื่องราวในวันนี้ไปได้อย่างราบรื่น อยากทำสิ่งใดก็ควรเริ่มลงมือทำ เพราะจะได้ผลลัพธ์ออกมาดีกว่าที่คิดเอาไว้มาก"
    },
    
    { name: "The Emperor",
        image: "images/Emperor.jpg",
        meaning: "ทุกอย่างเป็นไปตามแผนที่วางเอาไว้ จัดการทุกอย่างออกมาได้อย่างราบรื่น แต่ต้องระวังการหักโหมเพื่อสิ่งตรงหน้ามากเกินไปจนลืมดูแลตัวเอง เต็มที่กับงานหรือการเรียนได้แต่ต้องรู้ขีดจำกัดของตัวเองด้วยเช่นกัน"
    },
    
    { name: "The Hierophant",
        image: "images/Hierophant.jpg",
        meaning: "คุณจะได้รับคำแนะนำจากผู้ใหญ่หรือคนรอบข้าง เพื่อเป็นแนวทางในการปฏิบัติให้ชีวิตในวันนี้ราบรื่นมากกว่าเดิม พยายามถ่อมตัวและน้อมรับคำแนะนำนั้นเอาไว้แล้วคุณจะรู้สึกว่ามันมีประโยชน์มากกว่าที่คิด"
    },
    
    { name: "The Lovers",
        image: "images/Lovers.jpg",
        meaning: "คุณจะรู้สึกว่าวันนี้มีเรื่องมากมายที่จะต้องตัดสินใจ ไพ่จึงอยากเตือนให้วิเคราะห์สถานการณ์ด้วยเหตุผล อย่างรีบด่วนตัดสินอะไรด้วยอารมณ์ชั่ววูบ เพราะบางอย่างจะนำมาซึ่งผลดีหรือร้ายตามที่คุณได้เลือกไปได้"
    },
    
    { name: "The Chariot",
        image: "images/Chariot.jpg",
        meaning: "ทำไมวันนี้เจอปัญหาที่ต้องแก้เยอะเต็มไปหมด เพราะปลายทางของวันนี้คือรางวัลของคนที่ไม่ยอมและยังคงสู้ต่อ ยิ่งคุณเจออุปสรรคปัญหามากแค่ไหน ตัวคุณก็จะเข้มแข็งมากขึ้นเท่านั้น"
    },
    
    { name: "Strength",
        image: "images/Strength.jpg",
        meaning: "วันนี้เป็นวันที่คุณจะต้องใช้ความอดทนในการรอผลลัพธ์เรื่องที่กำลังรอคอยหรือรับมือกับอุปสรรคที่กำลังจะเจอในวันนี้ พยายามใจเย็นและมีสติให้มาก จะทำให้ท่านผ่านวันนี้ไปได้อย่างราบรื่น"
    },
    
    { name: "The Hermit",
        image: "images/Hermit.jpg",
        meaning: "วันนี้อยากอยู่กับตัวเองมากกว่าปกติ ไม่ค่อยอยากออกไปเจอผู้คนหรือทำกิจกรรมกับใคร ลองใช้เวลานี้ทบทวนเรื่องต่าง ๆ ที่เกิดขึ้นกับตัวเองบ้างก็ได้ บางทีคำตอบที่กำลังตามหาอาจอยู่ในความคิดของเราเอง"
    },
    
    { name: "Wheel of Fortune",
        image: "images/Wheel_of_Fortune.jpg",
        meaning: "มีโอกาสได้รับทั้งข่าวดีหรือร้ายในวันนี้ เตรียมตัวรับมือกับทุกเหตุการณ์ที่จะเกิดขึ้น แล้วคุณจะผ่านวันนี้ไปได้อย่างราบรื่น"
    },
    
    { name: "Justice",
        image: "images/Justice.jpg",
        meaning: "มีความคิดที่เป็นแบบแผน จัดการปัญหาได้ด้วยตนเอง มีเรื่องที่จะต้องตัดสินใจและมองถึงความเท่าเทียมหรือข้อได้เปรียบและเสียเปรียบ จนบางครั้งก็ใช้เหตุผลเยอะเกินจนดูเป็นคนเย็นชาได้"
    },
    
    { name: "The Hanged Man",
        image: "images/Hanged Man.jpg",
        meaning: "ทำอะไรก็รู้สึกว่าติดขัด อย่าเพิ่งรีบตัดสินใจ แต่ให้คุณลองถอยออกมาดูปัญหาให้รอบด้านก่อน แล้วคุณจะแก้ปัญหาที่อยู่ตรงหน้านั้นได้เอง"
    },
    
    { name: "Death",
        image: "images/Death.jpg",
        meaning: "ถึงเวลาปล่อยผ่านเรื่องราวในอดีต เพื่อเปิดทางตอนรับสิ่งใหม่ ๆ ที่กำลังรอคุณอยู่ในวันนี้ อย่ายึดติดสิ่งที่ผ่านไปแล้ว แต่ทำปัจจุบันออกมาให้เต็มที่"
    },
    
    { name: "Temperance",
        image: "images/Temperance.jpg",
        meaning: "สิ่งใดที่มากไปก็ควรปรับลดลงมา สิ่งใดที่น้อยเกินไปก็ควรปรับให้พอดี หาจุดกึ่งกลางให้วันนี้เราเดินหน้าต่อได้อย่างราบรื่น คุณเดินต่อได้ดีไม่ใช่เพราะยึดติดกับมัน แต่เป็นเพราะรู้จักปรับตัวและยืดหยุ่นกับปัญหาที่เข้ามาต่างหาก" 
    },
    
    { name: "The Devil",
        image: "images/Devil.jpg",
        meaning: "ในวันนี้คุณจะมีความต้องการที่อยากจะทำสิ่งที่คาดหวังให้ออกมาสำเร็จ แต่ต้องระวังไม่ให้ตัวเราเดินในเส้นทางที่ผิดจนส่งผลเสียต่อตัวเอง พยายามเปลี่ยนความต้องการให้กลายเป็นแรงผลักดันในการพัฒนาตัวเอง จะทำให้คุณเอาชนะความรู้สึกและดำเนินชีวิตได้อย่างราบรื่น"
    },
    
    { name: "The Tower",
        image: "images/Tower.jpg",
        meaning: "ระวังการยึดถือสิ่งใดสิ่งหนึ่งมากเกินไป เพราะวันนี้มีโอกาสที่จะต้องเจอกับการเปลี่ยนแปลงที่ไม่สามารถหลีกเลี่ยงได้ ดังนั้นคุณจึงไม่ควรประมาทและเตรียมแผนรับมือกับสิ่งที่อาจเกิดขึ้นเอาไว้เสมอ"
    },
    
    { name: "The Star",
        image: "images/Star.jpg",
        meaning: "การกลับมามีความหวังอีกครั้ง เริ่มต้นทำสิ่งต่าง ๆ เพื่อให้วันนี้ออกมาราบรื่นหรือน่าพอใจตามที่เราตั้งใจเอาไว้ เป็นวันที่รู้สึกได้ปล่อยวาง เรื่องที่อยู่ภายในใจเริ่มเบาลง กลับมาฮีลใจและดูแลตัวเองได้อย่างเต็มที่มากขึ้น"
    },
    
    { name: "The Moon",
        image: "images/Moon.jpg",
        meaning: "มีความรู้สึกหม่นหมองอยู่ภายในใจ เรื่องที่ค้างคาใจยังคงไม่ได้คำตอบ มีบางอย่างที่ต้องรอเวลากว่าความจริงจะเปิดเผย และระวังความเครียดจากความกังวลเรื่องอนาคตที่จะมาถึงมากเกินไป"
    },
    
    { name: "The Sun",
        image: "images/Sun.jpg",
        meaning: "มีความสุขกับการเริ่มต้นวันใหม่ พลังงานเต็มเปี่ยมไปด้วยความรู้สึกที่ดี เรื่องที่เคยมีปัญหาจะได้รับการสะสาง เรื่องกังวลใจจะได้รับการคลี่คลาย ทำสิ่งใดก็มีโอกาสที่จะประสบความสำเร็จสูง"
    },
    
    { name: "Judgement",
        image: "images/Judgement.jpg",
        meaning: "ทำดีได้ดี ทำชั่วได้ชั่ว ผลลัพธ์จะดีหรือไม่ ขึ้นอยู่กับตัวคุณว่าเลือกเดินเส้นทางไหน จึงควรคิดดีและทำดีเข้าไว้ให้มากจะเป็นผลดีต่อตัวคุณเอง"
    },
    
    { name: "The World",
        image: "images/World.jpg",
        meaning: "การปิดจบเพื่อก้าวไปสู่สิ่งที่ดียิ่งขึ้น ได้รับอิสระหรือความสบายใจหลังจากปัญหาบางอย่างคลี่คลายลง มีโอกาสได้รับข่าวดีที่ทำให้วันนี้รู้สึกมีความสุขและพอใจกับสิ่งที่ได้พบเจอ"
    },
    
];

let randomCards = [];

function randomCard(){
    let shuffled = [...cards];
    shuffled.sort(()=>Math.random()-0.5);
    randomCards = shuffled.slice(0,3);
    let button = document.getElementById("drawButton");
    document.getElementById("drawButton").textContent="เปิดไพ่";
    document.getElementById("drawText").textContent="🪄กดปุ่มเพื่อเปิดไพ่🪄";
    button.onclick = openCard;
}

let card1 = document.getElementById("card1");
let card2 = document.getElementById("card2");
let card3 = document.getElementById("card3");

function openCard(){
    card1.classList.add("flip");
    card2.classList.add("flip");
    card3.classList.add("flip");
    
    setTimeout(function(){
        card1.src = randomCards[0].image;
        card2.src = randomCards[1].image;
        card3.src = randomCards[2].image;
    }, 500);
    
    setTimeout(function(){
        document.getElementById("meaning-img1").src = randomCards[0].image;
        document.getElementById("meaning-name1").textContent = randomCards[0].name;
        document.getElementById("meaning-card1").textContent = randomCards[0].meaning;
        
        document.getElementById("meaning-img2").src = randomCards[1].image;
        document.getElementById("meaning-name2").textContent = randomCards[1].name;
        document.getElementById("meaning-card2").textContent = randomCards[1].meaning;
        
        document.getElementById("meaning-img3").src = randomCards[2].image;
        document.getElementById("meaning-name3").textContent = randomCards[2].name;
        document.getElementById("meaning-card3").textContent = randomCards[2].meaning;
        
    }, 2400);
}



